Процедура ВыгрузитьФайлы(сзФЛ, ПутьККаталогу, флагИзображение = Истина,  флагФайл = Истина, флагОтборОписанийДоков = Истина, стрОтборОписанийДоков) Экспорт
	спрХранилищеДопинфо = Справочники.ХранилищеДополнительнойИнформации;
	
	РазмерМассиваОписанийДоков = 0;
	Если флагОтборОписанийДоков Тогда
		массивОписанийДоков = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(СтрЗаменить(стрОтборОписанийДоков," ",""), ",");
			РазмерМассиваОписанийДоков = массивОписанийДоков.Количество();
	КонецЕсли; 
	
	//Без отбора - покидаем процедуру
	Если  НЕ ФлагИзображение И НЕ ФлагФайл Тогда
		Возврат;
	КонецЕсли;
	
	//Засекаем время
	ВремяНачалаВыполнения = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХранилищеДополнительнойИнформации.Объект,
		|	ХранилищеДополнительнойИнформации.Ссылка,
		|	ВЫБОР 
		|		КОГДА ( ХранилищеДополнительнойИнформации.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительнойИнформацииОбъектов.Файл) ) ТОГДА ХранилищеДополнительнойИнформации.Наименование
		|		ИНАЧЕ NULL 
		|	КОНЕЦ КАК ОписаниеДока
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
		|ГДЕ
		|	ХранилищеДополнительнойИнформации.Объект В(&сзФЛ)";
		
		//Отбор: Изображение, файл, описание документов
		Если ФлагИзображение И ФлагФайл И флагОтборОписанийДоков Тогда
			
			Запрос.Текст = Запрос.Текст + "
			|И(
			|	ХранилищеДополнительнойИнформации.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительнойИнформацииОбъектов.Изображение)
			|	ИЛИ( 
			|		ХранилищеДополнительнойИнформации.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительнойИнформацииОбъектов.Файл)
			|		И ПОДСТРОКА(ХранилищеДополнительнойИнформации.Наименование, 1, 1) В (&массивОписанийДоков)
			|	)
			|)";	
			
		//Отбор: файл, описание документов
		ИначеЕсли НЕ ФлагИзображение И ФлагФайл И флагОтборОписанийДоков Тогда
			
			Запрос.Текст = Запрос.Текст + "
			|И ХранилищеДополнительнойИнформации.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительнойИнформацииОбъектов.Файл)
			|И ПОДСТРОКА(ХранилищеДополнительнойИнформации.Наименование, 1, 1) В (&массивОписанийДоков)";	
			
		//Отбор: изображение
		ИначеЕсли ФлагИзображение И НЕ ФлагФайл Тогда
			
			Запрос.Текст = Запрос.Текст + "
			|	И ХранилищеДополнительнойИнформации.ВидДанных = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительнойИнформацииОбъектов.Изображение)";	
		
		КонецЕсли; 
		
		//В остальных случаях отбираем все записи хранилища для каждого из сзФЛ
	
	Запрос.УстановитьПараметр("сзФЛ", сзФЛ);
	Запрос.УстановитьПараметр("массивОписанийДоков", массивОписанийДоков);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Состояние("Запись файлов...");
	
	Сообщить("Запись файлов...");
	Сообщить("");
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДвОбъект = ВыборкаДетальныеЗаписи.Ссылка.Хранилище.Получить();
		ИмяФайла = ВыборкаДетальныеЗаписи.Объект.Наименование+" (№ "+СокрЛП(ВыборкаДетальныеЗаписи.Объект.Код)+")_"+Строка(ВыборкаДетальныеЗаписи.Ссылка.ВидДанных)+"-"+ВыборкаДетальныеЗаписи.ОписаниеДока+"_"+ВыборкаДетальныеЗаписи.Ссылка.ИмяФайла;
		ПолноеИмяФайла = ПутьККаталогу+"\"+ИмяФайла;
		
		Попытка
			ДвОбъект.Записать(ПолноеИмяФайла);
			Состояние(ИмяФайла);
			//Сообщить(ИмяФайла);
		Исключение
			Предупреждение("Ошибка при записи файла" + ПолноеИмяФайла);
		КонецПопытки;
		
	КонецЦикла;
	
	//Время выполнения
	ВремяОкончанияВыполнения = ТекущаяДата();
	Затрачено = ВремяОкончанияВыполнения - ВремяНачалаВыполнения;
	Сообщить("-------------------------------");	
	Сообщить("ВремяНачалаВыполнения: "+ВремяНачалаВыполнения);	
	Сообщить("ВремяОкончанияВыполнения: "+ВремяОкончанияВыполнения);	
	Сообщить("Затрачено времени, (сек): "+Формат(Затрачено, "ДФ='HH:mm:ss'"));	
	Сообщить("==========================");
КонецПроцедуры;