Процедура ВосстановитьЗначениеСПроверкой(ИмяСохраненногоЗначения, Реквизит)
	СохраненноеЗначение = ВосстановитьЗначение(ИмяСохраненногоЗначения);
	Если СохраненноеЗначение <> Неопределено Тогда
		Реквизит = СохраненноеЗначение;
	КонецЕсли;	
КонецПроцедуры // ВосстановитьЗначениеСПроверкой()
 
Процедура ДобавитьСтрокуВТабПолеСотрудники(ВыбранноеЗначение)
	//Для того чтобы не было задвоений при выборе, наложим условие
	Если ЭлементыФормы.Сотрудники.Значение.НайтиСтроки(Новый Структура("Сотрудник", ВыбранноеЗначение)).Количество() = 0 Тогда
		НоваяСтрока = ЭлементыФормы.Сотрудники.Значение.Добавить();
		НоваяСтрока.Сотрудник = ВыбранноеЗначение;
		НоваяСтрока.ТабельныйНомерСтрока = ВыбранноеЗначение.Код;
		НоваяСтрока.ДатаПриема = ВыбранноеЗначение.ДатаПриемаНаРаботу;
		НоваяСтрока.Должность = ВыбранноеЗначение.ТекущаяДолжностьОрганизации;
		НоваяСтрока.Подразделение = ВыбранноеЗначение.ТекущееПодразделениеОрганизации;
		НоваяСтрока.Организация = ВыбранноеЗначение.ТекущееОбособленноеПодразделение;
	КонецЕсли;
КонецПроцедуры

Процедура КнопкаВыполнитьНажатие(Кнопка)
	КаталогВыгрузки = "";
	сзФЛ = Новый СписокЗначений;
	
	//Выбор каталога
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога; 
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытия.Каталог = ""; 
	ДиалогОткрытия.МножественныйВыбор = Ложь; 
	ДиалогОткрытия.Заголовок = "Выберите каталог"; 
	
	Если ДиалогОткрытия.Выбрать() Тогда 
		ПутьККаталогу = ДиалогОткрытия.Каталог; 
	КонецЕсли;   
		
	//Отбор по Физ. лицам
	Если ЭлементыФормы.ОсновнаяПанель.ТекущаяСтраница.Имя = "ФизЛица" Тогда
		сзФЛ.ЗагрузитьЗначения(ЭлементыФормы.ФизЛица.Значение.ВыгрузитьКолонку("ФизЛицо"));	
	//Отбор по сотрудникам	
	Иначе
		Сообщить("Выбрана страница - Сотрудники");
		Для каждого Стр из ЭлементыФормы.Сотрудники.Значение Цикл
			сзФл.Добавить(Стр.Сотрудник.Физлицо);	
		КонецЦикла;	
	КонецЕсли;
		ВыгрузитьФайлы(сзФЛ, ПутьККаталогу, флагИзображение,  флагФайл, флагОтборОписанийДоков, ОтборОписанийДоков);
КонецПроцедуры


Процедура ФизЛицаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЭлементыФормы.ФизЛица.ТекущаяСтрока.ТабельныйНомерСтрока = ЭлементыФормы.ФизЛица.ТекущаяСтрока.ФизЛицо.Код;
КонецПроцедуры


Процедура КоманднаяПанельФизЛицаЗаполнитьФЛ(Кнопка)
	Если Вопрос("Очистить таблицу 'Физические лица'?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
	КонецЕсли; 
	
	ЭлементыФормы.ФизЛица.Значение.Очистить();
	спрФизЛица = Справочники.ФизическиеЛица;
	ЗапросФЛ = Новый Запрос;
	ЗапросФЛ.Текст = "ВЫБРАТЬ
	                 |	ФизическиеЛица.Код КАК Код,
	                 |	ФизическиеЛица.Ссылка КАК Ссылка
	                 |ИЗ
	                 |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	                 |ГДЕ
	                 |	НЕ (ФизическиеЛица.ЭтоГруппа
	                 |	ИЛИ ФизическиеЛица.ПометкаУдаления)
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	ФизическиеЛица.Наименование";
					 
	Результат = ЗапросФЛ.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 
	   НоваяСтрока = ЭлементыФормы.ФизЛица.Значение.Добавить();
	   НоваяСтрока.ТабельныйНомерСтрока = Выборка.Код;
	   НоваяСтрока.ФизЛицо = Выборка.Ссылка;
	КонецЦикла;
КонецПроцедуры


Процедура КоманднаяПанельСотрудникиПодбор(Кнопка)
	ПроцедурыУправленияПерсоналом.ОткрытьФормуВыбораСотрудникаОрганизации(ЭлементыФормы.Сотрудники, ЭтаФорма, Ложь, ДатаСреза, , 2, , ЭлементыФормы.Сотрудники.Значение.ВыгрузитьКолонку("Сотрудник"));
КонецПроцедуры

Процедура СотрудникиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЭлементыФормы.Сотрудники.ТекущаяСтрока.ТабельныйНомерСтрока = ЭлементыФормы.Сотрудники.ТекущаяСтрока.Сотрудник.Код;
	ЭлементыФормы.Сотрудники.ТекущаяСтрока.ДатаПриема = ЭлементыФормы.Сотрудники.ТекущаяСтрока.Сотрудник.ДатаПриемаНаРаботу;
	ЭлементыФормы.Сотрудники.ТекущаяСтрока.Должность = ЭлементыФормы.Сотрудники.ТекущаяСтрока.Сотрудник.ТекущаяДолжностьОрганизации;
	ЭлементыФормы.Сотрудники.ТекущаяСтрока.Подразделение = ЭлементыФормы.Сотрудники.ТекущаяСтрока.Сотрудник.ТекущееПодразделениеОрганизации;
	ЭлементыФормы.Сотрудники.ТекущаяСтрока.Организация = ЭлементыФормы.Сотрудники.ТекущаяСтрока.Сотрудник.ТекущееОбособленноеПодразделение;
КонецПроцедуры


Процедура ПриОткрытии()
	// Восстанавливаем сохраненные значения реквизитов
	ВосстановитьЗначениеСПроверкой("ОбрВыгрФайловИзХранилищаФЛ_ДатаСреза", ДатаСреза);
	ВосстановитьЗначениеСПроверкой("ОбрВыгрФайловИзХранилищаФЛ_ДатаУволенных", ДатаУволенных);
	ВосстановитьЗначениеСПроверкой("ОбрВыгрФайловИзХранилищаФЛ_Организация", Организация);
	ВосстановитьЗначениеСПроверкой("ОбрВыгрФайловИзХранилищаФЛ_флагИзображение", флагИзображение);
	ВосстановитьЗначениеСПроверкой("ОбрВыгрФайловИзХранилищаФЛ_флагФайл", флагФайл);
	ВосстановитьЗначениеСПроверкой("ОбрВыгрФайловИзХранилищаФЛ_флагОтборОписанийДоков", флагОтборОписанийДоков);
	ВосстановитьЗначениеСПроверкой("ОбрВыгрФайловИзХранилищаФЛ_ОтборОписанийДоков", ОтборОписанийДоков);
	
	//ДатаСреза = РабочаяДата;
	//ДатаУволенных = РабочаяДата;
	//Организация = Справочники.Организации.НайтиПоНаименованию("АО ""Гидроэлектромонтаж""");
	//флагИзображение = Истина;
	//флагФайл = Истина;
	//флагОтборОписанийДоков = Истина;
	//ОтборОписанийДоков = "1,2";
КонецПроцедуры


Процедура СотрудникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.СотрудникиОрганизаций") Тогда
		ДобавитьСтрокуВТабПолеСотрудники(ВыбранноеЗначение);
	КонецЕсли;
КонецПроцедуры


Процедура КоманднаяПанельСотрудникиЗаполнитьСотрудниками(Кнопка)
	Если Вопрос("Очистить таблицу 'Сотрудники'?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
	КонецЕсли; 
	ПроцедурыУправленияПерсоналом.ОткрытьФормуОтбораСпискаРаботников(ЭтаФорма, ДатаСреза, , Организация, )
КонецПроцедуры


Процедура ОбработкаВыбора(ЗначениеВыбора, Источник)
		
	Если ТипЗнч(ЗначениеВыбора) = Тип("Структура") Тогда
		Команда = "";
		Если ЗначениеВыбора.Свойство("Команда",Команда) и Команда = "ЗаполнитьСписокРаботников" Тогда
			тзИсточник = ЗначениеВыбора.Данные.Выгрузить();
			ЭлементыФормы.Сотрудники.Значение.Очистить();
			Для каждого Стр Из тзИсточник Цикл
				ДобавитьСтрокуВТабПолеСотрудники(Стр.Сотрудник);
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры


Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	// Сохраним значения указанные в реквизитах
	СохранитьЗначение("ОбрВыгрФайловИзХранилищаФЛ_ДатаСреза", ДатаСреза);
	СохранитьЗначение("ОбрВыгрФайловИзХранилищаФЛ_ДатаУволенных", ДатаУволенных);
	СохранитьЗначение("ОбрВыгрФайловИзХранилищаФЛ_Организация", Организация);
	СохранитьЗначение("ОбрВыгрФайловИзХранилищаФЛ_флагИзображение", флагИзображение);
	СохранитьЗначение("ОбрВыгрФайловИзХранилищаФЛ_флагФайл", флагФайл);
	СохранитьЗначение("ОбрВыгрФайловИзХранилищаФЛ_флагОтборОписанийДоков", флагОтборОписанийДоков);
	СохранитьЗначение("ОбрВыгрФайловИзХранилищаФЛ_ОтборОписанийДоков", ОтборОписанийДоков);

КонецПроцедуры

